Revit 2026 API

# RebarBarTypeGetCrankRatio Method

---

Gets the crank ratio taking into account the specified Rebar Crank Type.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GetCrankRatio(
	ElementId rebarCrankTypeId
)
```
```vb
Public Function GetCrankRatio (
	rebarCrankTypeId As ElementId
) As Double
```
```cpp
public:
double GetCrankRatio(
	ElementId^ rebarCrankTypeId
)
```
```fsharp
member GetCrankRatio :
        rebarCrankTypeId : ElementId -> float
```

#### Parameters

rebarCrankTypeId ElementId
     The Rebar Crank Type id. Interactions with Rebar Crank Types can be done with the functions in [!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils].

#### Return Value

Double Returns the crank ratio.

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category. |
| ArgumentNullException | A non-optional argument was null |

The crank slope is 1/crankRatio.

#### Reference

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace